# Database Name : RSQL
# Table Name : score
- id, korean, english, mathematics

- Anaconda Navigator
- rJava,RMySQL 설치

In [2]:
library(RMySQL)

In [10]:
# DB Connection

conn <- dbConnect(MySQL(),
                  dbname = 'moviesTone',
                  user = 'root',
                  password = 'qwer1234',
                  host = '127.0.0.1'
                 )

In [11]:
# 테이블 목록
dbListTables(conn)

[1] "director"       "director_actor" "distributor"    "genre"
[5] "ju_actor"       "movie"          "user"           "year_screen"

In [13]:
# 테이블의 컬럼 목록
dbListFields(conn, 'ju_actor')

[1] "ju_actor_id"    "ju_actor_name"  "ju_actor_score"

In [14]:
# Select
dbGetQuery(conn, 'select count(*) from ju_actor')

  count(*)
1 0

In [15]:
dbGetQuery(conn, 'select * from ju_actor')

     ju_actor_id ju_actor_name ju_actor_score

In [ ]:
read.csv("../")

In [8]:
dbSendQuery(conn, 'insert into score values (1,100,100,100)')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  100    100     100

In [9]:
dbSendQuery(conn, 'insert into score values (2,90,90,90)')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  100    100     100
2 2   90     90      90

In [11]:
# Update
dbSendQuery(conn, 'update score set korean = 90, english = 80, mathematics = 70 where id = 2')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  100    100     100
2 2   90     80      70

In [13]:
dbSendQuery(conn, 'delete from score')

result = dbGetQuery(conn, 'select * from score')
result

     id korean english mathematics

In [26]:
# csv file을 읽어서 MySQL에 넣기
data <- read.csv("../Data/score.csv",header=F)
colnames(data) = c("id","korean","english","mathmatics")
data

   id korean english mathmatics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [27]:
dbWriteTable(conn, "score", data, overwrite =T, row.names = F) # append=T(overwrite 안쓸시에 추가 넣는 방식)

[1] TRUE

In [28]:
data2 <- read.csv("../Data/score2.csv",header=F)
colnames(data2) = c("id","korean","english","mathmatics")
data2

  id korean english mathmatics
1 11 90     80      70
2 12 90     88      70

In [29]:
dbWriteTable(conn, "score", data2,append =T, row.names = F)

[1] TRUE

In [30]:
result = dbGetQuery(conn, 'select * from score')
result

   id korean english mathmatics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11 11  90     80      70
12 12  90     88      70

In [31]:
#Disconnect
dbDisconnect(conn)

[1] TRUE